Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E10B.tmx
Source language: en_us
Languages: zh_cn

source: Tips for Pet-Proofing Your Furniture
zh_cn: 防止宠物破坏家具的小窍门

source: There's nothing quite like the unconditional love from your furry (or feathered) friend.
zh_cn: 什么也比不上你的宠物朋友的无条件的爱了。

source: In fact, sharing your home with an animal companion is one of the most fulfilling choices you can make in life.
zh_cn: 事实上，和你的动物伙伴住在一起是你一生中让你感到最有满足感的决定之一。

source: However, living with an animal does have its drawbacks - especially when it comes to keeping your beloved furniture pristine.
zh_cn: 不过，和宠物住在一起也有缺点的——特别是提到如何使你心爱的家具保持原样这点上。

source: Here are a few helpful tips designed to keep your furniture safe from prying paws.
zh_cn: 下面是一些让你的家具免受这些巴头探脑的动物的抓挠的建议。

source: Spray Deterrents - You can easily find spray deterrent products at your local pet store.
zh_cn: 喷雾威慑——这类喷雾阻吓产品能很容易地你当地的宠物商店被找到。

source: Some are designed specifically for pets, some just for dogs and some for all animals.
zh_cn: 有一些是特别为宠物而设计的，一些为狗狗设计的而另外一些则是用在其他动物身上的。

source: The idea here is to associate your furniture with a taste or smell that is repulsive to your pet, but won't be noticeable to you (or your guests).
zh_cn: 这个主意意在让你的家具同你的宠物所排斥的味道或气味联系起来，不过，不要让你自己或者你的客人觉得气味过于引人注意。

source: When choosing a product, make sure it is both safe for your pet and will not discolor or otherwise harm your furniture.
zh_cn: 选择一样喷雾产品的时候，确保它对你的宠物是安全的，并且不会让你的家具褪色或是造成其他的损害。

source: Try the product on an inconspicuous spot before dousing an entire sofa.
zh_cn: 在往整张沙发上喷喷雾之前，先在一个不显眼的位置试一下喷雾。

source: Slip Covers and Throws - Sometimes it's impossible to keep pets from making themselves at home in certain spots.
zh_cn: 用沙发套和罩单吧 ——有时候要让你的宠物不要总是固定呆在家里某处简直是不可能的。

source: Cats, for instance, have a habit of finding a favorite perch on the back of a chair or sofa and will continue to use this spot regardless of how many times to try to discourage them.
zh_cn: 比如说，猫就有在椅子或是沙发后面找个自己最喜欢的位置，然后不管你尝试多少次去阻止它，它就是一直霸着这个位置。

source: If this is the case, use washable slip covers and throws that can easily be removed when company comes to call.
zh_cn: 如果你家宠物的情况就是这样的话，那就在朋友来拜访的时候用可轻易移除的可洗沙发套和罩单罩在沙发上吧！

source: Work on Your Pet's Behavior - Like a child, your animal companion is not born knowing the difference between what is expected and what is frowned upon.
zh_cn: ——宠物就像小孩子一样，不是天生就知道你所期望的和你所感到不悦的事情之间的区别。

source: Try to begin working with your pet when they are younger by using positive reinforcement when they listen to your commands.
zh_cn: 那么在你的宠物的幼年时期，试着在它们听从你的指令时开始用正强化的方法训练他们。

source: Often by simply teaching your animal friend not to jump on, claw, bite or scratch your furniture, hey will avoid this bad behavior for their entire lifetime.
zh_cn: 通常情况下，仅是简单地教会了你的宠物不要跳上、抓、啃咬或是挠你的家具之后，它们都能在之后的一生中避免做出这些坏行为。
